# в саду сорвали цветы
garden = ('ромашка', 'роза', 'одуванчик', 'ромашка', 'гладиолус', 'подсолнух', 'роза')

# на лугу сорвали цветы
meadow = ('клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчик', 'ромашка')

# создайте множество цветов, произрастающих в саду и на лугу
# garden_set =
# meadow_set =
garden_set = ['тюльпан', 'нарциссы', 'ландыш', 'гвоздика']
meadow_set = ['зверобой', 'подснежник', 'колокольчик']
# выведите на консоль все виды цветов
print(garden_set, meadow_set, garden, meadow)
# выведите на консоль те, которые растут и там и там
print(garden, meadow)
# выведите на консоль те, которые растут в саду, но не растут на лугу
print(garden_set, garden)
# выведите на консоль те, которые растут на лугу, но не растут в саду
print(meadow_set, meadow)
