# TODO: Напишите программу, которая выводит на экран текст "Hello, World!" (с кавычками!).

print('\"Hello, World\"') # \ - экранирует символ