# Напишите программу, которая выводит на экран текст "Hello, World!" (без кавычек).
print("Hello, World!")