# Здесь когда-нибудь появится нейросеть из стаканов и бумажек, которая сможет играть в "11 палочек"

# Пример словаря:
manowar_songs = {1: 'Hail and Kill',
                 2: 'Metal Warriors',
                 3: 'The Sons of Odin',
                 4: 'The Lord of Steel',
                 5: 'The Power and the Glory',
                 6: 'The Oath',
                 7: 'The Sign of the Hammer',
                 8: 'Return of the Warlord'}
print(manowar_songs[2])  # Выводит 'Metal Warriors'

# Примечание:
# В словаре можно хранить любые базовые типы данных, в т.ч. списки и даже другие словари

#  Начинаем заполнять стаканы бумажками.
#  Стаканы - это словари, в которых будут храниться бумажки.
#  Бумажки - это переменные с числом 1 или 2.

# TODO:
#   Создать словарь, имитирующий 11 стаканов с бумажками (цифры 1 и 2 по 3шт каждой)
#   Удалить этот блок
#   git commit
#   git push
