# Здесь когда-нибудь появится нейросеть из стаканов и бумажек, которая сможет играть в "11 палочек"

stakanchiku ={'stakan1': [1, 1, 1, 2, 2, 2],
             'stakan2': [1, 1, 1, 2, 2, 2],
             'stakan3': [1, 1, 1, 2, 2, 2],
             'stakan4': [1, 1, 1, 2, 2, 2],
             'stakan5': [1, 1, 1, 2, 2, 2],
             'stakan6': [1, 1, 1, 2, 2, 2],
             'stakan7': [1, 1, 1, 2, 2, 2],
             'stakan8': [1, 1, 1, 2, 2, 2],
             'stakan9': [1, 1, 1, 2, 2, 2],
             'stakan10': [1, 1, 1, 2, 2, 2],
             'stakan11': [1, 1, 1, 2, 2, 2]}
